import numpy as np
import pandas as pd

houses_sp = pd.read_csv('/home/arturaguilar426/GitHub/projetos/Plus-Education.github.io/Análise Exploratória de Dados (python)/planilhas/houses_sp.csv') # Ler o arquivo CSV

print("\n--------------------------------------------------------- Exebição do Gráfico: -------------------------------------------------------------------------\n")
a = houses_sp.head(10)
print(a) # Mostrar as 10 primeiras linhas da planilha
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")

print("\n--------------------------------------------------------- Frequência dos dados: ------------------------------------------------------------------------\n")
b = houses_sp['city'].value_counts()
print(b) # Mostrar a contagem de cada cidade
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")

print("\n---------------------------------------------------------- Informações sobre a planilha: ---------------------------------------------------------------\n")
c = houses_sp.info()
print(c) # Mostrar informações sobre a planilha
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")


houses_sp = houses_sp.drop(columns= ['city'])

print("\n-------------------------------------------- Exebição do Gráfico após a exclusão de colunas: -----------------------------------------------------------\n")
d = houses_sp.head()
print(d) # Mostrar as 10 primeiras linhas da planilha sem a coluna 'city'
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")

print("\n--------------------------------------------------------- Informações da coluna 'rooms': ---------------------------------------------------------------\n")
e = houses_sp['rooms']
print(e) # Mostrar a coluna 'rooms'
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")

print("\n--------------------------------------------- Informações da coluna 'rooms' com descrição: -------------------------------------------------------------\n")
f = houses_sp.info()
print(f) # Mostrar informações sobre a planilha sem a coluna 'city'
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")

print("\n------------------------------------------------ Exebição da mediana da coluna 'rooms': ----------------------------------------------------------------\n")
g = houses_sp['rooms'].median()
print(g) # Mostrar a mediana da coluna 'rooms'
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")

print("\n---------------------------------------------- Exebição das mediana da coluna 'rooms': -----------------------------------------------------------------\n")
houses_sp['rooms'] = houses_sp['rooms'].fillna(houses_sp['rooms'].median())
h = houses_sp.head()
print(h) # Mostrar as 10 primeiras linhas da planilha com a coluna 'rooms' preenchida com a mediana
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")

print("\n--------------------------------- Exebição da mediana da coluna 'rooms' após a prática do fillna: ------------------------------------------------------\n")
i = houses_sp.loc[houses_sp['floor'] == '-', 'floor'] = '0'
print(i) # Mostrar a coluna 'floor' com os valores '-' substituídos por '0'
print("--------------------------------------------------------------------------------------------------------------------------------------------------------")